Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: lispref/numbers.texi:413 There are four functions to convert floating point numbers to integers; they differ in how they round. All accept an argument @var{number} and an optional argument @var{divisor}. Both arguments may be integers or floating point numbers. @var{divisor} may also be @code{nil}. If @var{divisor} is @code{nil} or omitted, these functions convert @var{number} to an integer, or return it unchanged if it already is an integer. If @var{divisor} is non-@code{nil}, they divide @var{number} by @var{divisor} and convert the result to an integer. An @code{arith-error} results if @var{divisor} is 0.
fr_fr: Il y a quatre fonctions pour convertir des nombres à virgule flottante en nombres entiers; ils diffèrent dans la façon dont ils arrondissent. Tous acceptent un argument @var{number} et un argument facultatif @var{divisor}. Les deux arguments peuvent être des nombres entiers ou des nombres à virgule flottante. @var{divisor} peut également être @code{nil}. Si @var{divisor} est @code{nil} ou omis, ces fonctions convertissent @var{number} en nombre entier, ou le renvoient sans changement si c'est déjà un nombre entier. Si @var{divisor} est non-@code{nil}, elles divisent @var{number} par @var{divisor} et convertissent le résultat en nombre entier. Un @code{arith-error} en résulte si @var{divisor} est 0.

source: lispref/numbers.texi:417 This returns @var{number}, converted to an integer by rounding towards zero.
fr_fr: Ceci renvoie @var{number}, converti en nombre entier arrondis vers zéro.

source: lispref/numbers.texi:427 (truncate 1.2) @result{} 1 (truncate 1.7) @result{} 1 (truncate -1.2) @result{} -1 (truncate -1.7) @result{} -1
fr_fr: (truncate 1.2) @result{} 1 (truncate 1.7) @result{} 1 (truncate -1.2) @result{} -1 (truncate -1.7) @result{} -1

source: lispref/numbers.texi:433 This returns @var{number}, converted to an integer by rounding downward (towards negative infinity).
fr_fr: Ceci renvoie @var{number}, converti en nombre entier en arrondissant en bas (vers moins l'infini).

source: lispref/numbers.texi:436 If @var{divisor} is specified, this uses the kind of division operation that corresponds to @code{mod}, rounding downward.
fr_fr: Si @var{divisor} est indiqué, ceci utilise le genre d'opération de division qui correspond à @code{mod}, arrondissant en bas.

source: lispref/numbers.texi:448 (floor 1.2) @result{} 1 (floor 1.7) @result{} 1 (floor -1.2) @result{} -2 (floor -1.7) @result{} -2 (floor 5.99 3) @result{} 1
fr_fr: (floor 1.2) @result{} 1 (floor 1.7) @result{} 1 (floor -1.2) @result{} -2 (floor -1.7) @result{} -2 (floor 5.99 3) @result{} 1

source: lispref/numbers.texi:454 This returns @var{number}, converted to an integer by rounding upward (towards positive infinity).
fr_fr: Ceci renvoie @var{number}, converti en nombre entier en arrondissant vers le haut (vers plus l'infini).

source: lispref/numbers.texi:464 (ceiling 1.2) @result{} 2 (ceiling 1.7) @result{} 2 (ceiling -1.2) @result{} -1 (ceiling -1.7) @result{} -1
fr_fr: (ceiling 1.2) @result{} 2 (ceiling 1.7) @result{} 2 (ceiling -1.2) @result{} -1 (ceiling -1.7) @result{} -1

source: lispref/numbers.texi:472 This returns @var{number}, converted to an integer by rounding towards the nearest integer. Rounding a value equidistant between two integers may choose the integer closer to zero, or it may prefer an even integer, depending on your machine.
fr_fr: Ceci renvoie @var{number}, converti en nombre entier arrondi vers le nombre entier le plus proche. L'arrondi d'une valeur équidistante entre deux nombres entiers peut choisir le nombre entier plus près de zéro, ou il peut préférer un nombre entier équivalent, selon votre machine.

source: lispref/numbers.texi:482 (round 1.2) @result{} 1 (round 1.7) @result{} 2 (round -1.2) @result{} -1 (round -1.7) @result{} -2
fr_fr: (round 1.2) @result{} 1 (round 1.7) @result{} 2 (round -1.2) @result{} -1 (round -1.7) @result{} -2

source: lispref/numbers.texi:494 Emacs Lisp provides the traditional four arithmetic operations: addition, subtraction, multiplication, and division. Remainder and modulus functions supplement the division functions. The functions to add or subtract 1 are provided because they are traditional in Lisp and commonly used.
fr_fr: Le Emacs Lisp fournit les quatre opérations arithmétiques traditionnelles: addition, soustraction, multiplication et division. Les fonctions de reste et de modulo complètent les fonctions de division. Les fonctions additionner ou soustraire 1 sont fournis parce qu'elles sont traditionnelles en Lisp et utilisées généralement.

source: lispref/numbers.texi:497 All of these functions except @code{%} return a floating point value if any argument is floating.
fr_fr: Toutes ces fonctions, à part @code{%}, retourne une valeur à virgule flottante si au moins un argument est une valeur à virgule flottante.

source: lispref/numbers.texi:501 It is important to note that in Emacs Lisp, arithmetic functions do not check for overflow. Thus @code{(1+ 268435455)} may evaluate to @minus{}268435456, depending on your hardware.
fr_fr: Il est important de noter qu'en Emacs Lisp, les fonctions arithmétiques ne vérifient pas le débordement. Ainsi @code{(1+ 268435455)} peut être évaluer à @minus{}268435456, selon votre matériel.

source: lispref/numbers.texi:511 (setq foo 4) @result{} 4 (1+ foo) @result{} 5
fr_fr: (setq foo 4) @result{} 4 (1+ foo) @result{} 5

source: lispref/numbers.texi:515 This function is not analogous to the C operator @code{++}---it does not increment a variable. It just computes a sum. Thus, if we continue,
fr_fr: Cette fonction n'est pas analogue à l'opérateur C @code{++} ---elle n'incrémente pas une variable---. Elle calcule juste la somme. Ainsi, si nous continuons,

source: lispref/numbers.texi:519 foo @result{} 4
fr_fr: foo @result{} 4

source: lispref/numbers.texi:523 If you want to increment the variable, you must use @code{setq}, like this:
fr_fr: Si vous voulez incrémenter la variable, vous devez employer @code{setq}, comme ceci:

source: lispref/numbers.texi:527 (setq foo (1+ foo)) @result{} 5
fr_fr: (setq foo (1+ foo)) @result{} 5

source: lispref/numbers.texi:537 This function adds its arguments together. When given no arguments, @code{+} returns 0.
fr_fr: Cette fonction fait la somme de ses arguments. Si aucun argument n'est donné, @code{+} retourne 0.

source: lispref/numbers.texi:545 (+) @result{} 0 (+ 1) @result{} 1 (+ 1 2 3 4) @result{} 10
fr_fr: (+) @result{} 0 (+ 1) @result{} 1 (+ 1 2 3 4) @result{} 10

source: lispref/numbers.texi:55 but some machines may provide a wider range. Many examples in this chapter assume an integer has 29 bits.
fr_fr: mais quelques machines peuvent définir un autre champ. Beaucoup d'exemples en ce chapitre supposent qu'un nombre entier a 29 bits.

source: lispref/numbers.texi:554 The @code{-} function serves two purposes: negation and subtraction. When @code{-} has a single argument, the value is the negative of the argument. When there are multiple arguments, @code{-} subtracts each of the @var{more-numbers-or-markers} from @var{number-or-marker}, cumulatively. If there are no arguments, the result is 0.
fr_fr: La fonction @code{-} atteint deux objectifs: négation et soustraction. Quand @code{-} a un argument simple, la valeur est le négatif de l'argument. Quand il y a des arguments multiples, @code{-} soustrait chacun des @var{more-numbers-or-markers} de @var{number-or-marker}, de manière cumulée. S'il n'y a aucun argument, le résultat est 0.

source: lispref/numbers.texi:562 (- 10 1 2 3 4) @result{} 0 (- 10) @result{} -10 (-) @result{} 0
fr_fr: (- 10 1 2 3 4) @result{} 0 (- 10) @result{} -10 (-) @result{} 0

source: lispref/numbers.texi:568 This function multiplies its arguments together, and returns the product. When given no arguments, @code{*} returns 1.
fr_fr: Cette fonction multiplie ses arguments entre elles, et renvoie le produit. Si aucun argument n'est donné, @code{*} retourne 1.

source: lispref/numbers.texi:576 (*) @result{} 1 (* 1) @result{} 1 (* 1 2 3 4) @result{} 24
fr_fr: (*) @result{} 1 (* 1) @result{} 1 (* 1 2 3 4) @result{} 24

source: lispref/numbers.texi:584 This function divides @var{dividend} by @var{divisor} and returns the quotient. If there are additional arguments @var{divisors}, then it divides @var{dividend} by each divisor in turn. Each argument may be a number or a marker.
fr_fr: Cette fonction divise @var{dividend} par @var{divisor} et retourne le quotient. S'il y a des arguments additionnels @var{divisors}, il divise @var{dividend} par chaque diviseur alternativement. Chaque argument peut être un nombre ou un marqueur.

source: lispref/numbers.texi:59 The Lisp reader reads an integer as a sequence of digits with optional initial sign and optional final period.
fr_fr: Le lecteur de Lisp lit un nombre entier comme une séquence de chiffres avec le signe initial et le point final facultatifs.

source: lispref/numbers.texi:592 If all the arguments are integers, then the result is an integer too. This means the result has to be rounded. On most machines, the result is rounded towards zero after each division, but some machines may round differently with negative arguments. This is because the Lisp function @code{/} is implemented using the C division operator, which also permits machine-dependent rounding. As a practical matter, all known machines round in the standard fashion.
fr_fr: Si tous les arguments sont des nombres entiers, alors le résultat est aussi un nombre entier. Ceci signifie que le résultat doit être arrondi. Sur la plupart des machines, le résultat est arrondi vers le zéro après chaque division, mais quelques machines peuvent arrondir différemment les arguments négatifs. C'est parce que la fonction de Lisp @code{/} est implémentée en utilisant l'opérateur de division de C qui permet l'arrondi en fonction de la machine. Du côté pratique, toutes les machines connues arrondissent en mode standard.

source: lispref/numbers.texi:598 If you divide an integer by 0, an @code{arith-error} error is signaled. (@xref{Errors}.) Floating point division by zero returns either infinity or a NaN if your machine supports @acronym{IEEE} floating point; otherwise, it signals an @code{arith-error} error.
fr_fr: Si vous divisez un nombre entier par 0, une erreur @code{arith-error} est signalée. (@xref{Errors}.) La division d'un nombre à virgule flottante par zéro renvoie l'un ou l'autre infini ou NaN si votre machine supporte les nombres à virgule flottante @acronym{IEEE}; autrement, elle signale une erreur @code{arith-error}.

source: lispref/numbers.texi:603 (/ 6 2) @result{} 3
fr_fr: (/ 6 2) @result{} 3

source: lispref/numbers.texi:614 (/ 5 2) @result{} 2 (/ 5.0 2) @result{} 2.5 (/ 5 2.0) @result{} 2.5 (/ 5.0 2.0) @result{} 2.5 (/ 25 3 2) @result{} 4
fr_fr: (/ 5 2) @result{} 2 (/ 5.0 2) @result{} 2.5 (/ 5 2.0) @result{} 2.5 (/ 5.0 2.0) @result{} 2.5 (/ 25 3 2) @result{} 4

source: lispref/numbers.texi:617 (/ -17 6) @result{} -2 @r{(could in theory be @minus{}3 on some machines)}
fr_fr: (/ -17 6) @result{} -2 @r{(pourrait être @minus{}3 sur certaines machines)}

source: lispref/numbers.texi:625 This function returns the integer remainder after division of @var{dividend} by @var{divisor}. The arguments must be integers or markers.
fr_fr: Cette fonction renvoie le reste en nombre entier après la division de @var{dividend} par @var{divisor}. Les arguments doivent être des nombres entiers ou des marqueurs.

source: lispref/numbers.texi:628 For negative arguments, the remainder is in principle machine-dependent since the quotient is; but in practice, all known machines behave alike.
fr_fr: Pour des arguments négatifs, le reste est en principe dépendant de la machine puisque le quotient est variable; mais dans la pratique, toutes les machines connues se comportent de la même façon.

source: lispref/numbers.texi:640 (% 9 4) @result{} 1 (% -9 4) @result{} -1 (% 9 -4) @result{} 1 (% -9 -4) @result{} -1
fr_fr: (% 9 4) @result{} 1 (% -9 4) @result{} -1 (% 9 -4) @result{} 1 (% -9 -4) @result{} -1

source: lispref/numbers.texi:648 (+ (% @var{dividend} @var{divisor}) (* (/ @var{dividend} @var{divisor}) @var{divisor}))
fr_fr: (+ (% @var{dividend} @var{divisor}) (* (/ @var{dividend} @var{divisor}) @var{divisor}))

source: lispref/numbers.texi:661 This function returns the value of @var{dividend} modulo @var{divisor}; in other words, the remainder after division of @var{dividend} by @var{divisor}, but with the same sign as @var{divisor}. The arguments must be numbers or markers.
fr_fr: Cette fonction renvoie la valeur de @var{dividend} modulo @var{divisor}; en d'autres termes, le reste après la division de @var{dividend} par @var{divisor}, mais avec le même signe que @var{divisor}. Les arguments doivent être des nombres ou des marqueurs.

source: lispref/numbers.texi:666 Unlike @code{%}, @code{mod} returns a well-defined result for negative arguments. It also permits floating point arguments; it rounds the quotient downward (towards minus infinity) to an integer, and uses that quotient to compute the remainder.
fr_fr: À la différence de @code{%}, @code{mod} renvoie un résultat bien défini pour les arguments négatifs. Il permet également des arguments à virgule flottante; il arrondit le quotient à un nombre entier vers le bas (vers moins l'infini), et utilise ce quotient pour calculer le reste.

source: lispref/numbers.texi:673 (mod 9 4) @result{} 1
fr_fr: (mod 9 4) @result{} 1

source: lispref/numbers.texi:677 (mod -9 4) @result{} 3
fr_fr: (mod -9 4) @result{} 3

source: lispref/numbers.texi:68 1 ; @r{The integer 1.} 1. ; @r{The integer 1.} +1 ; @r{Also the integer 1.} -1 ; @r{The integer @minus{}1.} 536870913 ; @r{Also the integer 1, due to overflow.} 0 ; @r{The integer 0.} -0 ; @r{The integer 0.}
fr_fr: 1 ; @r{L'entier 1.} 1. ; @r{L'entier 1.} +1 ; @r{Encore l'entier 1.} -1 ; @r{L'entier @minus{}1.} 536870913 ; @r{Encore l'entier 1, dû au débordement.} 0 ; @r{L'entier 0.} -0 ; @r{L'entier 0.}

source: lispref/numbers.texi:681 (mod 9 -4) @result{} -3
fr_fr: (mod 9 -4) @result{} -3

source: lispref/numbers.texi:685 (mod -9 -4) @result{} -1
fr_fr: (mod -9 -4) @result{} -1

source: lispref/numbers.texi:689 (mod 5.5 2.5) @result{} .5
fr_fr: (mod 5.5 2.5) @result{} .5

source: lispref/numbers.texi:698 (+ (mod @var{dividend} @var{divisor}) (* (floor @var{dividend} @var{divisor}) @var{divisor}))
fr_fr: (+ (mod @var{dividend} @var{divisor}) (* (floor @var{dividend} @var{divisor}) @var{divisor}))

source: lispref/numbers.texi:705 always equals @var{dividend}, subject to rounding error if either argument is floating point. For @code{floor}, see @ref{Numeric Conversions}.
fr_fr: est toujours égale à @var{dividend}, sauf si l'un ou l'autre argument est un nombre à virgule flottante, une erreur sera générée. Pour @code{floor}, voir les @ref{Conversions numériques}.

source: lispref/numbers.texi:717 The functions @code{ffloor}, @code{fceiling}, @code{fround}, and @code{ftruncate} take a floating point argument and return a floating point result whose value is a nearby integer. @code{ffloor} returns the nearest integer below; @code{fceiling}, the nearest integer above; @code{ftruncate}, the nearest integer in the direction towards zero; @code{fround}, the nearest integer.
fr_fr: Les fonctions @code{ffloor}, @code{fceiling}, @code{fround}, et @code{ftruncate} prennent un argument à virgule flottante et renvoient un monbre à virgule flottante représentant la valeur d'un nombre entier voisin. @code{ffloor} renvoie le nombre entier le plus proche inférieur; @code{fceiling}, le nombre entier le plus proche supérieur; @code{ftruncate}, le nombre entier le plus proche de zéro; @code{fround}, le nombre entier le plus proche.

source: lispref/numbers.texi:721 This function rounds @var{float} to the next lower integral value, and returns that value as a floating point number.
fr_fr: Cette fonction arrondit @var{float} à la prochaine valeur intégrale inférieure, et renvoie cette valeur comme nombre à virgule flottante.

source: lispref/numbers.texi:726 This function rounds @var{float} to the next higher integral value, and returns that value as a floating point number.
fr_fr: Cette fonction arrondit @var{float} à la prochaine valeur intégrale supérieure, et renvoie cette valeur comme nombre à virgule flottante.

source: lispref/numbers.texi:731 This function rounds @var{float} towards zero to an integral value, and returns that value as a floating point number.
fr_fr: Cette fonction arrondit @var{float} à la valeur intégrale proche de zéro, et renvoie cette valeur comme nombre à virgule flottante.

source: lispref/numbers.texi:736 This function rounds @var{float} to the nearest integral value, and returns that value as a floating point number.
fr_fr: Cette fonction arrondit @var{float} à la valeur intégrale la plus proche, et renvoie cette valeur comme nombre de virgule flottante.

source: lispref/numbers.texi:748 In a computer, an integer is represented as a binary number, a sequence of @dfn{bits} (digits which are either zero or one). A bitwise operation acts on the individual bits of such a sequence. For example, @dfn{shifting} moves the whole sequence left or right one or more places, reproducing the same pattern ``moved over.''
fr_fr: Dans un ordinateur, un nombre entier est représenté comme nombre binaire, une séquence de @dfn{bits} (des chiffres qui sont zéro ou un). Une opération de bits agit sur les bits individuels d'une telle séquence. Par exemple, le @dfn{shifting} déplace l'ordre entier à gauche ou à droite d'une ou plusieures places, pour reproduire le même modèle ``moved over.''

source: lispref/numbers.texi:759 @code{lsh}, which is an abbreviation for @dfn{logical shift}, shifts the bits in @var{integer1} to the left @var{count} places, or to the right if @var{count} is negative, bringing zeros into the vacated bits. If @var{count} is negative, @code{lsh} shifts zeros into the leftmost (most-significant) bit, producing a positive result even if @var{integer1} is negative. Contrast this with @code{ash}, below.
fr_fr: @code{lsh}, qui est une abréviation de @dfn{logical shift}, décale les bits dans @var{integer1} de @var{count} places à gauche, ou vers la droite si @var{count} est négatif, introduisant des zéros dans les places vacantes des bits. Si @var{count} est négatif, @code{lsh} décale les zéros dans l'extrême gauche du bit (plus fort), produisant un résultat positif même si @var{integer1} est négatif. Contrairement à @code{ash}, ci-dessous.

source: lispref/numbers.texi:763 Here are two examples of @code{lsh}, shifting a pattern of bits one place to the left. We show only the low-order eight bits of the binary pattern; the rest are all zero.
fr_fr: Voici deux exemples de @code{lsh}, décalant une combinaison de chiffres binaires d'une place vers la gauche. Nous montrons seulement les huit bits faibles du binaire modèle; le reste est fait de zéro.

source: lispref/numbers.texi:770 (lsh 5 1) @result{} 10 ;; @r{Decimal 5 becomes decimal 10.} 00000101 @result{} 00001010
fr_fr: (lsh 5 1) @result{} 10 ;; @r{Decimal 5 becomes decimal 10.} 00000101 @result{} 00001010

source: lispref/numbers.texi:775 (lsh 7 1) @result{} 14 ;; @r{Decimal 7 becomes decimal 14.} 00000111 @result{} 00001110
fr_fr: (lsh 7 1) @result{} 14 ;; @r{La décimale 7 devient la décimale 14.} 00000111 @result{} 00001110

source: lispref/numbers.texi:782 As the examples illustrate, shifting the pattern of bits one place to the left produces a number that is twice the value of the previous number.
fr_fr: Comme ces exemples le montrent, lorsqu'on décale la combinaison de chiffres binaires d'une place vers la gauche, on produit un nombre qui est le double de la valeur du précédent nombre.

source: lispref/numbers.texi:785 Shifting a pattern of bits two places to the left produces results like this (with 8-bit binary numbers):
fr_fr: Lorsqu'on décale de deux places une combinaison de chiffres binaires vers la gauche, on produit les résultats suivants (avec des nombres binaires de 8 bits):

source: lispref/numbers.texi:792 (lsh 3 2) @result{} 12 ;; @r{Decimal 3 becomes decimal 12.} 00000011 @result{} 00001100
fr_fr: (lsh 3 2) @result{} 12 ;; @r{La décimale 3 devient décimale 12.} 00000011 @result{} 00001100

source: lispref/numbers.texi:803 (lsh 6 -1) @result{} 3 ;; @r{Decimal 6 becomes decimal 3.} 00000110 @result{} 00000011
fr_fr: (lsh 6 -1) @result{} 3 ;; @r{La décimale 6 devient décimale 3.} 00000110 @result{} 00000011

source: lispref/numbers.texi:810 (lsh 5 -1) @result{} 2 ;; @r{Decimal 5 becomes decimal 2.} 00000101 @result{} 00000010
fr_fr: (lsh 5 -1) @result{} 2 ;; @r{La décimale 5 devient décimale 2.} 00000101 @result{} 00000010

source: lispref/numbers.texi:816 As the example illustrates, shifting one place to the right divides the value of a positive integer by two, rounding downward.
fr_fr: Comme l'exemple le montre, le décalage d'une place vers la droite divise la valeur d'un nombre entier positif par deux, arrondissant vers le bas.

source: lispref/numbers.texi:821 The function @code{lsh}, like all Emacs Lisp arithmetic functions, does not check for overflow, so shifting left can discard significant bits and change the sign of the number. For example, left shifting 268,435,455 produces @minus{}2 on a 29-bit machine:
fr_fr: La fonction @code{lsh}, comme toutes les fonctions arithmétiques d'Emacs Lisp, ne vérifie pas le débordement, ainsi de décalage à gauche peut changer le bit fort et changer le signe du nombre. Par exemple, le décalage à gauche de 268.435.455 produit @minus{}2 sur une machine de 29 bits :

source: lispref/numbers.texi:833 ;; @r{Decimal 268,435,455} 0 1111 1111 1111 1111 1111 1111 1111
fr_fr: ;; @r{La décimale 268 435 455} 0 1111 1111 1111 1111 1111 1111 1111

source: lispref/numbers.texi:84 The syntax for integers in bases other than 10 uses @samp{#} followed by a letter that specifies the radix: @samp{b} for binary, @samp{o} for octal, @samp{x} for hex, or @samp{@var{radix}r} to specify radix @var{radix}. Case is not significant for the letter that specifies the radix. Thus, @samp{#b@var{integer}} reads @var{integer} in binary, and @samp{#@var{radix}r@var{integer}} reads @var{integer} in radix @var{radix}. Allowed values of @var{radix} run from 2 to 36. For example:
fr_fr: La syntaxe pour des nombres entiers dans les bases autres que la base 10 utilise @samp{#} suivi d'une lettre qui indique la base: @samp{b} pour binaire, @samp{o} pour octal, @samp{x} pour hex, ou @samp{@var{base}r} pour indiquer la base @var{base}. Le cas n'est pas significatif pour la lettre qui indique la base. Ainsi, le @samp{#b@var{integer}} lit @var{integer} en base binaire, et le @samp{#@var{base}r@var{integer}} lit @var{integer} dans la base @var{base}. Les valeurs permises de @var{base} vont de 2 à 36. Par exemple:

source: lispref/numbers.texi:843 ;; @r{Decimal @minus{}2} 1 1111 1111 1111 1111 1111 1111 1110
fr_fr: ;; @r{La décimale @minus{}2} 1 1111 1111 1111 1111 1111 1111 1110

source: lispref/numbers.texi:852 @code{ash} (@dfn{arithmetic shift}) shifts the bits in @var{integer1} to the left @var{count} places, or to the right if @var{count} is negative.
fr_fr: @code{ash} (@dfn{arithmetic shift}) décale les bits dans @var{integer1} de @var{count} places vers la gauche, ou vers la droite si @var{count} est négatif.
